---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.NumberingFailures
source: html/fd65afe4-a7c9-f81b-4d02-fb09b5dabc3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.NumberingFailures

Failures related to object numbering operations.

## Syntax (C#)
```csharp
public static class NumberingFailures
```